Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
preproc (Lambda)             (None, 224, 224, 3)       0         
_________________________________________________________________
densenet121 (Model)          (None, 7, 7, 1024)        7037504   
_________________________________________________________________
avg_pool (GlobalAveragePooli (None, 1024)              0         
_________________________________________________________________
predictions (Dense)          (None, 3)                 3075      
=================================================================
Total params: 7,040,579
Trainable params: 3,075
Non-trainable params: 7,037,504
_________________________________________________________________


